verification/runs/ansys_verification/VMFL003/L2_500x5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          5;
        startFace       4495;
    }
    outlet
    {
        type            patch;
        nFaces          5;
        startFace       4500;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       4505;
    }
    wedge1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          2500;
        startFace       5005;
    }
    wedge2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          2500;
        startFace       7505;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       10005;
    }
)

// ************************************************************************* //
